#include "Header.h"

int main()
{
	system("chcp 1251>nul");
	printf("stdio.h подключена и работает");

	
	//Опишите сигнатуры пользовательских функций, выполняющих 4 основных арифметических действия.
	// Опишите тело данных функций ниже метода main.
	
		//Поместите сигнатуры пользовательских функций в созданный файл заголовка.Проверьте работоспособность программы.
		// Поместите в заголовочный файл все созданные арифметические функции целиком.Проверьте работоспособность программы.
		//Добавьте к проекту функцию для объединения двух указателей на массив символов(объединения двух строк).Поместите информацию о ней в заголовочный файл.
		//Разработайте функции для преобразования числа в строку и строки в число, используя стандартные типы данных.Поместите информацию о данных функциях в заголовочный файл.
	
	return 0;
}